# KipsPerCubicFoot Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
UnitTypeId..::..KipsPerCubicFoot Property
UnitTypeId Class See Also
---
Kips per cubic foot.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId KipsPerCubicFoot { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property KipsPerCubicFoot As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ KipsPerCubicFoot {
	ForgeTypeId^ get ();
}
```

# See Also
UnitTypeId Class
Autodesk.Revit.DB Namespace